# set arguments for all 'brew install --cask' commands
cask_args appdir: '~/Applications'

# install casks

# packages
brew 'asdf'
brew 'awscli'
brew 'bat'
brew 'coreutils'
brew 'ctags'
brew 'diff-so-fancy'
brew 'fd'
brew 'fpp'
brew 'fzf'
brew 'fish'
brew 'git'
brew 'gnupg'
brew 'gpg'
brew 'graphviz'
brew 'jq'
brew 'lsd'
brew 'mas'
brew 'neovim'
brew 'peco'
brew 'pinentry-mac'
brew 'pgcli'
brew 'ripgrep'
brew 'starship'
brew 'tmux'
brew 'urlview'
brew 'watchman'
brew 'wget'
brew 'yadm'
brew 'zlib'
brew 'zoxide'

# fonts
cask 'font-dejavu-sans-mono-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-monaspace-nerd-font'

# Casks
cask '1password', appdir: '/Applications'
cask '1password-cli'
cask 'docker'
#cask 'firefox'
#cask "google-chrome"
cask 'iterm2'
cask 'postico'
cask 'visual-studio-code' unless system "/usr/local/bin/code", "--failfast"

# Mac Apple Store
#mas 'xcode', id: 497_799_835
