# specify a directory to install
cask_args appdir: '/Applications'

# install casks
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# packages
brew 'awscli'
brew 'bat'
brew 'coreutils'
brew 'ctags'
brew 'diff-so-fancy'
brew 'fd'
brew 'fzf'
brew 'fish'
brew 'git'
brew 'gnupg'
brew 'graphviz'
brew 'jq'
brew 'lsd'
brew 'mas'
brew 'neovim'
brew 'peco'
brew 'pgcli'
brew 'ripgrep'
brew 'starship'
brew 'tmux'
brew 'watchman'
brew 'wget'
brew 'yadm'
brew 'zlib'
brew 'zoxide'

# fonts
cask 'font-jetbrainsmono-nerd-font'

# Casks
cask '1password'
cask 'anylist'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'iterm2'
cask 'karabiner-elements'
cask 'paw'
cask 'postico'
cask 'postman'
cask 'selfcontrol'
cask 'skype'
cask 'spotify'
cask 'visual-studio-code'

# Mac Apple Store
mas '2do', id: 477670270
mas 'kindle', id: 405399194
mas 'xcode', id: 497799835
mas 'dayone', id: 1055511498
